/* 
  Localizable.strings
  Self Service

  Created by Chris Ghanbarzadeh on 1/20/16.
  Copyright © 2016 JAMF Software. All rights reserved.
*/

// App Name
"SELF_SERVICE" = "Self Service";

// Menu Item Titles
"ABOUT_SELF_SERVICE" = "About %@";
"HIDE_SELF_SERVICE" = "Hide %@";
"QUIT_SELF_SERVICE" = "Quit %@";
"RELOAD_SELF_SERVICE" = "Reload %@";
"NEXT_SECTION" = "Next Section";
"PREVIOUS_SECTION" = "Previous Section";

// Toolbar Buttons
"TOOLBAR_HOME" = "Home";
"TOOLBAR_BROWSE" = "Browse";
"TOOLBAR_BROWSE_COLLAPSED" = "Browse - Collapsed"; // Only announced via VoiceOver, never displayed in the UI
"TOOLBAR_BROWSE_EXPANDED" = "Browse - Expanded"; // Only announced via VoiceOver, never displayed in the UI
"TOOLBAR_HISTORY" = "History";
"TOOLBAR_NOTIFICATIONS" = "Notifications";
"TOOLBAR_NOTIFICATIONS_HELP_NONE" = "No New Notifications"; // Only announced via VoiceOver, never displayed in the UI
"TOOLBAR_NOTIFICATIONS_HELP_ONE" = "1 New Notification"; // Only announced via VoiceOver, never displayed in the UI
"TOOLBAR_NOTIFICATIONS_HELP_SOME" = "%d New Notifications"; // Only announced via VoiceOver, never displayed in the UI

// Account Button
"LOG_IN_BUTTON" = "Log In";
"LOG_OUT_BUTTON" = "Log Out";

// Login
"LOGIN_USERNAME" = "Username";
"LOGIN_PASSWORD" = "Password";
"LOGIN_CANCEL" = "Cancel";
"LOGIN_INVALID_CREDENTIALS" = "Your username or password was entered incorrectly.";
"LOGIN_CONNECTION_ERROR" = "%@ cannot connect to the server.";
"LOGIN_SUCCESSFUL" = "Login successful"; // Only announced via VoiceOver, never displayed in the UI
"LOGIN_REMEMBER_ME" = "Remember Me";
"SAML_LOGIN_LABEL" = "%@ Login";
"SAML_LOG_IN_TO_CONTINUE" = "Log in to continue";
"SAML_FAILED_TO_AUTHENTICATE" = "Your login cannot be authenticated. To resolve this issue, contact your administrator.";
"SAML_UNKNOWN_ERROR" = "An unknown error has occurred. If this issue persists, contact your administrator.";

// Connection Error Bar
"CANT_CONNECT_ERROR" = "Cannot reach a Jamf MDM server";
"RETRYING" = "Retrying";
"CONNECTION_SUCCESSFUL" = "Successfully connected to a Jamf MDM server"; // Only announced via VoiceOver, never displayed in the UI

// Error Modal
"ERROR_MODAL_TITLE" = "There was an error with %@.";
"ERROR_MODAL_TEXT" = "Try again later or contact your administrator.";
"ERROR_MODAL_CLOSE" = "Close";

// Search
"SEARCH" = "Search";
"SEARCH_RESULTS_LABEL" = "Search results for";
"NO_RESULTS_LABEL" = "No results found for \"%@\"";
"SEARCH_AGAIN_LABEL" = "Try searching again.";
"SEARCH_RESULTS_COLLECTION_LABEL" = "Search results"; // Only announced via VoiceOver, never displayed in the UI
"SEARCH_RESULTS_COLLECTION_HELP" = "%d results found"; // Only announced via VoiceOver, never displayed in the UI
"SEARCH_RESULTS_COLLECTION_HELP_SINGULAR" = "1 result found"; // Only announced via VoiceOver, never displayed in the UI

// Home View
"RESULT" = "1 Result";
"RESULTS" = "%d Results";
"LEFT_ARROW" = "Left Arrow";
"RIGHT_ARROW" = "Right Arrow";
"FEATURED_ITEMS" = "Featured Items"; // Only announced via VoiceOver, never displayed in the UI
"BROWSE_ITEMS" = "Browse Items"; // Only announced via VoiceOver, never displayed in the UI
"BOOKMARK_ITEMS" = "Bookmark Items"; // Only announced via VoiceOver, never displayed in the UI
"CATEGORY" = "%@ Category";
"CATEGORIES" = "All Categories"; // Only announced via VoiceOver, never displayed in the UI
"FEATURED_LEFT_ARROW" = "Scrolls featured items to the left"; // Only announced via VoiceOver, never displayed in the UI
"FEATURED_RIGHT_ARROW" = "Scrolls featured items to the right"; // Only announced via VoiceOver, never displayed in the UI
"BROWSE_LEFT_ARROW" = "Scrolls browse categories to the left"; // Only announced via VoiceOver, never displayed in the UI
"BROWSE_RIGHT_ARROW" = "Scrolls browse categories to the right"; // Only announced via VoiceOver, never displayed in the UI
"BOOKMARKS_LEFT_ARROW" = "Scrolls bookmarks to the left"; // Only announced via VoiceOver, never displayed in the UI
"BOOKMARKS_RIGHT_ARROW" = "Scrolls bookmarks to the right"; // Only announced via VoiceOver, never displayed in the UI

// UI Elements
"CONTENT_INSTALL_BUTTON" = "Install";
"CONTENT_REMOVE_BUTTON" = "Remove";
"CONTENT_REINSTALL_BUTTON" = "Reinstall";
"CONTENT_APP_STORE" = "App Store";
"CONTENT_POLICY_RUN" = "Run";
"CONTENT_OPEN" = "Open";
"CONTENT_IBOOKS" = "iBooks";
"CONTENT_UPDATE_BUTTON" = "Update";
"CONTENT_CANCEL_BUTTON" = "Cancel"; // Only announced via VoiceOver, never displayed in the UI
"BOOKMARKS_NAME" = "Bookmarks";
"CATEGORY_DEVICE_COMPLIANCE" = "Device Compliance";
"CATEGORY_ALL" = "All";
"CATEGORY_FEATURED" = "Featured";
"CONTENT_NO_CONTENT" = "No Items";
"HISTORY_NO_CONTENT" = "No History";
"CLEAR" = "Clear";
"READ" = "Read"; // Only announced via VoiceOver, never displayed in the UI
"UNREAD" = "Unread"; // Only announced via VoiceOver, never displayed in the UI
"UNREAD_BUTTON_ACCESSIBLILTY" = "%@ Button, Click to Mark as %@"; // Only announced via VoiceOver, never displayed in the UI
"FEATURED_ITEM_ACCESSIBLILTY" = "Featured item"; // Only announced via VoiceOver, never displayed in the UI
"READ_MORE" = "Read More";
"MORE_ACCESSIBILITY_LABEL" = "More";

// Cancel content
"CANCEL_YES_BUTTON" = "Yes";
"CANCEL_NO_BUTTON" = "No";
"CANCEL_TITLE" = "Are you sure you want to cancel?";
"CANCEL_TEXT" = "Doing so may leave your computer in an unstable state.";
"CANCEL_POLICY_TEXT" = "Are you sure you want to cancel \"%@\"? Doing so may leave your computer in an unstable state.";
"CANCEL_EBOOK_TEXT" = "Are you sure you want to cancel \"%@\"?";
"CANCEL_PATCH_TEXT" = "Are you sure you want to cancel? Canceling a software update while in process may make the app unusable.";

// Content Progress Strings
"CONTENT_WAITING" = "Waiting";
"CONTENT_OPENING" = "Opening";
"CONTENT_INSTALLING" = "Installing";
"CONTENT_REMOVING" = "Removing";
"CONTENT_EXECUTING" = "Executing";
"CONTENT_DOWNLOADING" = "Downloading";
"CONTENT_RUNNING" = "Running";
"CONTENT_VERIFYING" = "Verifying";
"CONTENT_UPDATING" = "Updating";
"CONTENT_FINISHING" = "Finishing";
"CONTENT_DONE" = "Done!";
"CONTENT_CANCELED" = "Canceled";
"CONTENT_ERROR" = "Error";

// Info View
"INFO_CLOSE" = "Close";
"INFO_CANCEL" = "Cancel";
"INFO_NOT_AVAILABLE" = "This item is no longer available";
"INFO_OK" = "Ok";

// Bookmark Web View
"BOOKMARK_CLOSE" = "Close";
"BOOKMARK_CLOSE_HELP" = "Close %@"; // Only announced via VoiceOver, never displayed in the UI
"BOOKMARK_ERROR" = "Could not open \"%@\"";
"OPEN_IN_BROWSER" = "Open in Browser";
"BROWSER_BACK_BUTTON" = "Back"; // Only announced via VoiceOver, never displayed in the UI
"BROWSER_BACK_BUTTON_HELP" = "Click to show previous page"; // Only announced via VoiceOver, never displayed in the UI
"BROWSER_FORWARD_BUTTON" = "Forward"; // Only announced via VoiceOver, never displayed in the UI
"BROWSER_FORWARD_BUTTON_HELP" = "Click to show next page"; // Only announced via VoiceOver, never displayed in the UI

// VPP
"VPP_INVITATION_SUBTEXT" = "Accept invitation";
"VPP_INVITATION_ACCEPT_BUTTON" = "Accept";
"VPP_INVITATION_EXPLANATION" = "You must accept your organization’s invitation. You will not be able to install apps or books purchased in volume until you accept this invitation.";
"VPP_INVITATION_EXPLANATION_CONTENT" = "You must accept your organization's invitation to install this %@.";
"VPP_INVITATION_APPLICATION" = "application";
"VPP_INVITATION_EBOOK" = "book";
"VPP_INVITATION_PENDING" = "Invitation Pending";
"VPP_INVITATION_TRY_AGAIN_BUTTON" = "Try Again";
"VPP_INVITATION_PENDING_EXPLANATION" = "Your invitation is pending. If you did not accept your invitation, click Try Again to be reconnected to the App Store.";
"VPP_INVITATION_ACCEPTED_EXPLANATION" = "Your invitation has been accepted. You may now install apps and books purchased in volume.";

// About
"VERSION" = "Version";
"VERSION_UNKNOWN" = "Version Unknown";
"COPYRIGHT" = "Copyright";
"ALL_RIGHTS_RESERVED" = "All rights reserved.";
"ACKNOWLEDGEMENTS_BUTTON" = "Acknowledgements";

// History
"HISTORY_HEADER" = "History";
"HISTORY_VERSION" = "Version";
"HISTORY_INSTALLED" = "Installed";

// Updates
"SINGULAR_UPDATE_AVAILABLE_HEADER" = "Update Available";
"PLURAL_UPDATES_AVAILABLE_HEADER" = "Updates Available";
"UPDATES_AVAILABLE" = "Available";
"UPDATES_UPDATE_ALL" = "Update All";
"UPDATE_KILL_APP" = "You must close %@ before updating.";
"UPDATE_DEADLINE" = "Update Deadline";
"UPDATE_APPS_MUST_QUIT" = "Apps That Must Quit";
"UPDATES_INSTALL_ALL" = "Install All Updates";
"UPDATES_HEADER" = "Updates Header"; // Only announced via VoiceOver, never displayed in the UI

// Notifications
"NOTIFICATIONS_TITLE" = "Notifications"; // Only announced via VoiceOver, never displayed in the UI
"NOTIFICATIONS_NO_NOTIFICATIONS" = "No Notifications";
"NOTIFICATIONS_ITEM_FAILED" = "Item Failed";
"NOTIFICATIONS_DATE" = "Date:";
"NOTIFICATIONS_HEADER" = "Notifications Header"; // Only announced via VoiceOver, never displayed in the UI
"NOTIFICATIONS_MARK_ALL_READ" = "Mark All Read";

// Not Enrolled Error Screen
"NOT_ENROLLED_HEADING" = "Welcome to Self Service";
"NOT_ENROLLED_MESSAGE" = "Self Service is a component of Jamf MDM, developed by Jamf.\n\nThis app must be associated with a Jamf MDM server.\n\nContact your IT administrator for more information";
"JAMF_URL" = "jamf.com";

// Sorting options
"SORT_HEADER" = "Sort"; // Only announced via VoiceOver, never displayed in the UI
"SORT_ASCENDING" = "A…Z";
"SORT_DESCENDING" = "Z…A";
"SORT_FEATURED" = "Featured";

// UAMDM Popup
"UAMDM_APPROVE" = "You must approve your organization’s MDM Profile";
"UAMDM_CLICK_1" = "Click the ";
"UAMDM_APPROVE_BOLD" = "Open System Preferences";
"UAMDM_CLICK_2" = " button below and do the following:";
"UAMDM_STEP_1" = "1. Click the profile labeled “MDM Profile” in the Device Profiles column. It is identified by a yellow alert triangle.";
"UAMDM_STEP_2A" = "2. Click the ";
"UAMDM_STEP_2_BOLD" = "Approve";
"UAMDM_STEP_2B" = " button.";
"UAMDM_APPROVE_BUTTON" = "Open System Preferences";
"UAMDM_IMAGE_ACCESSIBILITY_LABEL" = "System Preferences Profile Example"; // Only announced via VoiceOver, never displayed in the UI

// Onboarding
"ONBOARDING_WELCOME" = "Welcome %@!";
"ONBOARDING_WELCOME_NO_NAME" = "Welcome!";
"ONBOARDING_CONFIRMATION_TITLE" = "Onboarding Complete!";
"ONBOARDING_CONFIRMATION_BUTTON" = "Continue";
"ONBOARDING_MESSAGE" = "Your organization is automatically configuring your computer. Do not restart or shut down your computer until this installation is complete. This may take some time to finish.";
"ONBOARDING_PENDING" = "Pending";
"ONBOARDING_PROGRESS_TEXT" = "%d of %d completed";
"ONBOARDING_INSTALLATION_STATUS_TITLE" = "Installation status";
"UNABLE_TO_QUIT" = "Unable to quit application";
"ONBOARDING_IN_PROGRESS" = "Onboarding in progress";
"ONBOARDING_ERROR_SINGLE" = "1 item failed to install";
"ONBOARDING_ERROR_MULTIPLE" = "%d items failed to install";
"ONBOARDING_ERROR_NEXT_STEPS" = "You can retry installing the failed items in the 'Notifications' tab or contact your IT administrator for further support.";
"ONBOADING_COMPLETE_TITLE" = "Setup Complete";
"ONBOARDING_COMPLETE_MESSAGE_SUCCESS" = "Your computer setup is finished and everything has been installed successfully.";
"ONBOARDING_COMPLETE_MESSAGE_FAILURE" = "Your computer setup is finished, but not all items have installed successfully.";
"ONBOARDING_COMPLETE_INFO" = "%d items are installed and are ready to be used";
"ONBOARDING_INSTALLED" = "Complete"; // Voiceover
"ONBOARDING_FAILED" = "Failed"; // Voiceover

// App Installer Modal
"APP_NOT_AVAILABLE" = "This application is unavailable. Try again later.";
